SIUE-ARC/ARC-Controller/PSoC-Code/ARC-EMBED.cydsn/Generated_Source/PSoC4/ADC1_PM.c
/*******************************************************************************
* File Name: ADC1.c  
* Version 2.20
*
* Description:
*  This file contains APIs to set up the Pins component for low power modes.
*
* Note:
*
********************************************************************************
* Copyright 2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#include "cytypes.h"
#include "ADC1.h"

static ADC1_BACKUP_STRUCT  ADC1_backup = {0u, 0u, 0u};


/*******************************************************************************
* Function Name: ADC1_Sleep
****************************************************************************//**
*
* \brief Stores the pin configuration and prepares the pin for entering chip 
*  deep-sleep/hibernate modes. This function must be called for SIO and USBIO
*  pins. It is not essential if using GPIO or GPIO_OVT pins.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None 
*  
* \sideeffect
*  For SIO pins, this function configures the pin input threshold to CMOS and
*  drive level to Vddio. This is needed for SIO pins when in device 
*  deep-sleep/hibernate modes.
*
* \funcusage
*  \snippet ADC1_SUT.c usage_ADC1_Sleep_Wakeup
*******************************************************************************/
void ADC1_Sleep(void)
{
    #if defined(ADC1__PC)
        ADC1_backup.pcState = ADC1_PC;
    #else
        #if (CY_PSOC4_4200L)
            /* Save the regulator state and put the PHY into suspend mode */
            ADC1_backup.usbState = ADC1_CR1_REG;
            ADC1_USB_POWER_REG |= ADC1_USBIO_ENTER_SLEEP;
            ADC1_CR1_REG &= ADC1_USBIO_CR1_OFF;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(ADC1__SIO)
        ADC1_backup.sioState = ADC1_SIO_REG;
        /* SIO requires unregulated output buffer and single ended input buffer */
        ADC1_SIO_REG &= (uint32)(~ADC1_SIO_LPM_MASK);
    #endif  
}


/*******************************************************************************
* Function Name: ADC1_Wakeup
****************************************************************************//**
*
* \brief Restores the pin configuration that was saved during Pin_Sleep().
*
* For USBIO pins, the wakeup is only triggered for falling edge interrupts.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None
*  
* \funcusage
*  Refer to ADC1_Sleep() for an example usage.
*******************************************************************************/
void ADC1_Wakeup(void)
{
    #if defined(ADC1__PC)
        ADC1_PC = ADC1_backup.pcState;
    #else
        #if (CY_PSOC4_4200L)
            /* Restore the regulator state and come out of suspend mode */
            ADC1_USB_POWER_REG &= ADC1_USBIO_EXIT_SLEEP_PH1;
            ADC1_CR1_REG = ADC1_backup.usbState;
            ADC1_USB_POWER_REG &= ADC1_USBIO_EXIT_SLEEP_PH2;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(ADC1__SIO)
        ADC1_SIO_REG = ADC1_backup.sioState;
    #endif
}


/* [] END OF FILE */
